CustomTabBar/src/router/request_configuração_VOIP_IMS.xml

<?xml version = '1.0' encoding = 'UTF-8'?>
<soapenv:Envelope
    xmlns:fn="http://www.w3.org/2005/xpath-functions"
    xmlns:ns0="http://lucent.com/ims/intf3"
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xs="http://www.w3.org/2001/XMLSchema"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header>
        <ns0:Timeout maxProcessingTime="120000"/>
        <ns0:Topology/>
    </soapenv:Header>
    <soapenv:Body>
        <ns0:CreateWorkItem>
            <parameters>
                <request>
                    <parameters>
                        <MapItems>
                            <key>actionCode</key>
                            <value>Add</value>
                        </MapItems>
                        <MapItems>
                            <key>service</key>
                            <value>B_IMS_Subscription</value>
                        </MapItems>
                        <MapItems>
                            <key>serviceCategory</key>
                            <value>CVOIP_FLEX</value>
                        </MapItems>
                        <group>
                            <groupName>B_IMS_Subscription</groupName>
                            <item>
                                <key>SubscriptionIdentity</key>
                                <value>4-1ZYM77A</value>
                            </item>
                            <group>
                                <groupName>PrivateUser</groupName>
                                <item>
                                    <key>PrivateUserIdentity</key>
                                    <value>4-1ZYM77A@ims.oi.net.br</value>
                                </item>
                                <group>
                                    <groupName>Credentials</groupName>
                                    <item>
                                        <key>LineIdentity</key>
                                        <value>RJ-LAB02-GALC GPON 1/1/01/02/3/1/1:1067/220</value>
                                    </item>
                                </group>
                            </group>
                            <group>
                                <groupName>ServiceProfile</groupName>
                                <item>
                                    <key>PublicUserIdentity</key>
                                    <value>sip:+553131020379@ims.oi.net.br</value>
                                </item>
                                <item>
                                    <key>PrivateUserReference</key>
                                    <value>4-1ZYM77A@ims.oi.net.br</value>
                                </item>
                                <group>
                                    <groupName>ServicePackage</groupName>
                                    <item>
                                        <key>ServicePackageName</key>
                                        <value>CTS</value>
                                    </item>
                                    <group>
                                        <groupName>ServiceData</groupName>
                                        <item>
                                            <key>Name</key>
                                            <value>ngfs-subscriber-v2</value>
                                        </item>
                                        <group>
                                            <groupName>ServiceData</groupName>
                                            <item>
                                                <key>Name</key>
                                                <value>SubParty</value>
                                            </item>
                                            <group>
                                                <groupName>ServiceAttribute</groupName>
                                                <item>
                                                    <key>Name</key>
                                                    <value>PtySpareString</value>
                                                </item>
                                                <item>
                                                    <key>Value</key>
                                                    <value>BHE_31000_CENTRO</value>
                                                </item>
                                            </group>
                                            <group>
                                                <groupName>ServiceAttribute</groupName>
                                                <item>
                                                    <key>Name</key>
                                                    <value>PrimaryPUIDCPEProfileNumber</value>
                                                </item>
                                                <item>
                                                    <key>Value</key>
                                                    <value>243</value>
                                                </item>
                                            </group>
                                        </group>
                                    </group>
                                </group>
                                <group>
                                    <groupName>ServicePackage</groupName>
                                    <item>
                                        <key>ServicePackageName</key>
                                        <value>AAA</value>
                                    </item>
                                    <group>
                                        <groupName>ServiceData</groupName>
                                        <item>
                                            <key>Name</key>
                                            <value>AAA_Subscriber</value>
                                        </item>
                                        <group>
                                            <groupName>ServiceAttribute</groupName>
                                            <item>
                                                <key>Name</key>
                                                <value>VoIP_ASSET_ID</value>
                                            </item>
                                            <item>
                                                <key>Value</key>
                                                <value>4-1ZYMBLI</value>
                                            </item>
                                        </group>
                                        <group>
                                            <groupName>ServiceAttribute</groupName>
                                            <item>
                                                <key>Name</key>
                                                <value>VoIP_ASSET_NUMBER</value>
                                            </item>
                                            <item>
                                                <key>Value</key>
                                                <value>1</value>
                                            </item>
                                        </group>
                                    </group>
                                </group>
                            </group>
                        </group>
                    </parameters>
                </request>
            </parameters>
        </ns0:CreateWorkItem>
    </soapenv:Body>
</soapenv:Envelope>